import React, {Component} from 'react';
import "./styles/about.css";

const about_blocks = [
    "В любом из салонов нашей сети Вас ждут высококвалифицированные специалисты, которые окажут Вам широкий спектр услуг. В наших салонах вы можете сделать стрижку, выполнить окрашивание, привести в идеальный вид ногти, сделать микроблейдинг бровей, а так же воспользоваться услугами косметолога и массажиста.",
    "Все наши мастера - настоящие профессионалы своего дела, в совершенстве владеющие как классическими салонными техниками, так и современными новинками косметического рынка. Поэтому наши мастера 2 раза в год повышают уровень квалиффикации. В наших салонах работают врачи с высшим медицинским образованием.",
    "Высочайший уровень услуг и великолепный результат гарантированны за счет использования только профессиональных сертифицированных косметических средств от официальных поставщиков. Наши специалисты помогут Вам индивидуально подобрать косметические средства- как для процедур, так и для домашнего ухода.",
    "Окунитесь в атмосферу заботы, красоты и релаксации, отрешитесь от суеты, по-настоящему отдохните. В сети салонов красоты \"Апельсин\" сохранят Вашу молодость и красоту в атмосфере чуткой заботы и радушия. Салоны красоты \"Апельсин\" - это поистине самый близкий путь к красоте, все салоны удобны.",
    "В любом из салонов нашей сети Вас ждут высококвалифицированные специалисты, которые окажут Вам широкий спектр услуг. В наших салонах вы можете сделать стрижку, выполнить окрашивание, привести в идеальный вид ногти, сделать микроблейдинг бровей, а так же воспользоваться услугами косметолога и массажиста.",
    "Все наши мастера - настоящие профессионалы своего дела, в совершенстве владеющие как классическими салонными техниками, так и современными новинками косметического рынка. Поэтому наши мастера 2 раза в год повышают уровень квалиффикации, проходя обучение у лучших специалистов России и Европы.",
];


class About extends Component{
    render() {
        return (
                <div className="row">
                    {about_blocks.map((item, i) => <AboutBlock item={item} key={i}/>)}
                </div>
        );
    }
}

const AboutBlock = ({item}) =>{
    return(
        <div className="col-xs-12 col-md-4">
            <div className="thumbnail about-block_text-block">
                {item}
            </div>
        </div>
    )
};

export default About;