import React, {Component} from 'react';
import Salon from "./salon-item";

const salons = [
    {
        name : 'Salon "at Sophia"',
        description : "Если Вы хотите иметь красивые ногти со стойким долговременным покрытием – к Вашим услугам все виды маникюра и педикюра, разнообразный дизайн ногтей, включая объемный дизайн, рисунки на ногтях, художественную роспись и французский маникюр! И все это на ВАШИХ НАТУРАЛЬНЫХ ногтях смогут сделать высококвалифицированные мастера нашего салона! Покрытие ногтей на Ваш выбор: гель-лаками, лаками и лечебным покрытием. Каждая клиентка нашего салона будет довольна маникюром.",
        img : "https://p0.zoon.ru/preview/M5NBf7lzXi22trvHQJKtLQ/520x270x85/1/5/2/original_59687dd564288e6542537ee0_59f2e30a4e61e.jpg"
    },
    {
        name : 'Salon "Parisian"',
        description : "Салон красоты «Rich» открыл двери для посетителей в июле 2011 года. С первого дня нашими базовыми принципами работы стали доброжелательность, чуткое отношение к каждому клиенту и высокий уровень профессионализма во всех сферах оказываемых услуг. С первых секунд пребывания в салоне вы окунетесь в атмосферу заботы и доброжелательности. Почувствуйте себя свободными от повседневной суеты, открыв новые ощущения и удовольствие от виртуозного мастерства наших специалистов!",
        img : "https://p1.zoon.ru/preview/sY-k_K3cPac8qpYkv3_NbA/520x270x85/1/1/5/original_5a3c935da24fd91bfb5e2e03_5ab89b57d0674.jpg"
    },

];



class SalonList extends Component{
    render() {
        return (
            <div className="home-block_info">
                <div className="row">
                    <div className="col-md-12">
                        <div className="row">
                            {salons.map( (salon, i) => {
                                return (
                                    <Salon key={i} data={salon} />
                                )
                            })}
                        </div>
                    </div>
                </div>
            </div>
        );
    }
}

export default SalonList;