import React from 'react';

class About extends React.Component {
  render() {
    return (
      <div className='about-container'>
        <h1 className='about-title'>барбершоп heisenberg</h1>
        <p className='about-description'>Это не просто мужская парикмахерская, а место, в котором можно прикоснуться к традициям лучших
        цирюлен прошлого века. Наши мастера подберут тебе новый образ и сделают свою работу качественно.
        Они не только профи в своем деле, но и хорошие собеседники, которые всегда дадут рекомендацию по уходу
за волосами, посоветуют средства и укажут на недостатки. Так же ты можешь выпить виски и поиграть в приставку.</p>
      </div>
    )
  }
}

export default About