export const trekkingAPI = {
    trekkingList: [
        {
            id: "121fg12",
            image: ("/images/baikal.jpg"),
            title: "Хамар-Дабан",
            region: "Байкал",
            complexity: "легкий",
            duration: "10-12 дней",
            type: "пеший",
            description: "Данный маршрут проходит по красивейшим долинам горных рек Мажой и Каракабак, по горам Северо-Чуйского хребта республики Алтай.",
            route: [
                {
                    day: "День первый",
                    plan: "Какой-то план"
                },
                {
                    day: "День второй",
                    plan: "Какой-то план второй"
                }
            ],
            equipment: "Здесь будет необходимое снаряжение"
        },

        {
            id: "221he18",
            image: ("/images/altai.jpg"),
            title: "Шавла-Маашей",
            region: "Горный Алтай",
            complexity: "легкий",
            duration: "10-12 дней",
            type: "горный",
            description: "Данный маршрут проходит по красивейшим долинам горных рек Мажой и Каракабак, по горам Северо-Чуйского хребта республики Алтай.",
            route: [
                {
                    day: "День первый",
                    plan: "Какой-то план"
                },
                {
                    day: "День второй",
                    plan: "Какой-то план второй"
                }
            ],
            equipment: "Здесь будет необходимое снаряжение"
        },

        {
            id: "221we36",
            image: ("/images/tian-shan.jpg"),
            title: "Тянь-Шань",
            region: "Тянь-шань",
            complexity: "сложный",
            duration: "10-12 дней",
            type: "горный",
            description: "Данный маршрут проходит по красивейшим долинам горных рек Мажой и Каракабак, по горам Северо-Чуйского хребта республики Алтай.",
            route: [
                {
                    day: "День первый",
                    plan: "Какой-то план"
                },
                {
                    day: "День второй",
                    plan: "Какой-то план второй"
                }
            ],
            equipment: "Здесь будет необходимое снаряжение"
        },

        {
            id: "221kl26",
            image: ("/images/beluha.jpg"),
            title: "Гора Белуха",
            region: "Горный Алтай",
            complexity: "легкий",
            duration: "10-12 дней",
            type: "горный",
            description: "Данный маршрут проходит по красивейшим долинам горных рек Мажой и Каракабак, по горам Северо-Чуйского хребта республики Алтай.",
            route: [
                {
                    day: "День первый",
                    plan: "Какой-то план"
                },
                {
                    day: "День второй",
                    plan: "Какой-то план второй"
                }
            ],
            equipment: "Здесь будет необходимое снаряжение"
        },

        {
            id: "221kl27",
            image: ("/images/beluha.jpg"),
            title: "Пример 1",
            region: "Горный Алтай",
            complexity: "легкий",
            duration: "10-12 дней",
            type: "горный",
            description: "Данный маршрут проходит по красивейшим долинам горных рек Мажой и Каракабак, по горам Северо-Чуйского хребта республики Алтай.",
            route: [
                {
                    day: "День первый",
                    plan: "Какой-то план"
                },
                {
                    day: "День второй",
                    plan: "Какой-то план второй"
                }
            ],
            equipment: "Здесь будет необходимое снаряжение"
        },

        {
            id: "221kl28",
            image: ("/images/beluha.jpg"),
            title: "Пример 2",
            region: "Горный Алтай",
            complexity: "легкий",
            duration: "10-12 дней",
            type: "горный",
            description: "Данный маршрут проходит по красивейшим долинам горных рек Мажой и Каракабак, по горам Северо-Чуйского хребта республики Алтай.",
            route: [
                {
                    day: "День первый",
                    plan: "Какой-то план"
                },
                {
                    day: "День второй",
                    plan: "Какой-то план второй"
                }
            ],
            equipment: "Здесь будет необходимое снаряжение"
        },

        {
            id: "221kl36",
            image: ("/images/beluha.jpg"),
            title: "Пример 3",
            region: "Горный Алтай",
            complexity: "легкий",
            duration: "10-12 дней",
            type: "горный",
            description: "Данный маршрут проходит по красивейшим долинам горных рек Мажой и Каракабак, по горам Северо-Чуйского хребта республики Алтай.",
            route: [
                {
                    day: "День первый",
                    plan: "Какой-то план"
                },
                {
                    day: "День второй",
                    plan: "Какой-то план второй"
                }
            ],
            equipment: "Здесь будет необходимое снаряжение"
        }
    ],
    all () { return this.trekkingList},
    get (id) {
        const isTrekking = p => p.id === id;
        return this.trekkingList.find(isTrekking)
    }
}